Autodesk.Revit.DB.Structure.LineLoad.SetPoints(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Sets start and end point of the line load.
Remarks:
This method works with non hosted line load only.
startPoint:
The start point.
endPoint:
The end point.
Returns:
Returns true if successful, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the end point is equal to the start point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad.GetCurve
Returns curve that define geometry of the line load.
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.LineLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new non-hosted line load within the project using data at point.
aDoc:
Document to which new line load will be added.
startPoint:
The start point of line load, measured in decimal feet.
endPoint:
The end point of line load, measured in decimal feet.
forceVector:
The applied 3d force vector.
momentVector:
The applied 3d moment vector.
symbol:
The symbol of the LineLoad. Set null to use default type.
plane:
The work plane of the LineLoad. Set null to use default plane.
Returns:
If successful, returns the newly created LineLoad, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when work plane is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when all force and moment vectors are equal zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.AnalyticalModelSurface,System.Int32,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.LineLoadType)
Creates a new hosted line load within the project.
aDoc:
Document to which new line load will be added.
host:
The analytical model surface host element for the line Load.
curveIndex:
The index of a curve in analytical surface element starting from 0.
Use Autodesk::Revit::DB::Structure::AnalyticalModelSurface::GetLoops(Autodesk::Revit::DB::Structure::AnalyticalLoopType::All) method to obtain appropriate curve index.
Curve index has a unique value in analytical surface element even if it contains more than one loop. The index should be obtain by iteration through all curves in all loops.
forceVector1:
The applied 3d force vector.
momentVector1:
The applied 3d moment vector.
symbol:
The symbol of the LineLoad. Set null to use default type.
Returns:
If successful, returns the newly created LineLoad, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when all force and moment vectors are equal zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.AnalyticalModelStick,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.LineLoadType)
Creates a new hosted line load within the project.
aDoc:
Document to which new line load will be added.
host:
The analytical model stick host element for the line Load.
forceVector1:
The applied 3d force vector.
momentVector1:
The applied 3d moment vector.
symbol:
The symbol of the LineLoad. Set null to use default type.
Returns:
If successful, returns the newly created LineLoad, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when all force and moment vectors are equal zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad.MomentVector2
The moment vector applied to the end point of the line load, oriented according to OrientTo setting.
Remarks:
The default force unit is kN-m/m for metric, and kip-ft/ft for imperial.
Use UnitUtils class methods to convert value from or to internal units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad.MomentVector1
The moment vector applied to the start point of the line load, oriented according to OrientTo setting.
Remarks:
The default force unit is kN-m/m for metric, and kip-ft/ft for imperial.
Use UnitUtils class methods to convert value from or to internal units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad.ForceVector2
The force vector applied to the end point of the line load, oriented according to OrientTo setting.
Remarks:
The default force unit is kN/m for metric, and kip/ft for imperial.
Use UnitUtils class methods to convert value from or to internal units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad.ForceVector1
The force vector applied to the start point of the line load, oriented according to OrientTo setting.
Remarks:
The default force unit is kN/m for metric, and kip/ft for imperial.
Use UnitUtils class methods to convert value from or to internal units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad.EndPoint
Returns the three dimensional location of the end point for the line load.
Remarks:
The location of the end point is measured in decimal feet.

Autodesk.Revit.DB.Structure.LineLoad.StartPoint
Returns the three dimensional location of the start point for the line load.
Remarks:
The location of the start point is measured in decimal feet.

Autodesk.Revit.DB.Structure.LineLoad.IsProjected
Indicates if the load is projected.
Remarks:
Returns true if the line load is projected, false otherwise.
This parameter will take effect only if LineLoad.OrientTo property is set to LoadOrientTo.Project.
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad.IsUniform
Indicates if the load is uniform.
Remarks:
Returns true if the line load is uniform, false otherwise.
Load is uniform when force and moment vectors assigned to the start and the end point of load are equal.
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad
An object that represents a force/moment applied in a linear manner.
Remarks:
The load/moment may be uniform or it may vary between the two ends of the line.